app/views/contracts/show.haml

SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
---
              %td
                = Client.find(@contract.client_id).name + Client.find(@contract.client_id).ruc

SELECT `contract_details`.* FROM `contract_details` WHERE `contract_details`.`contract_id` = 1
---
          %tbody
            - @contract.contract_details.each do |unit|

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
                %td
                  = Article.find(unit.article_id).name