app/views/products_lots/_form.html.haml

SELECT `products`.* FROM `products`
---

  $(document).ready(function () {
    if($('form[id^="edit_"]').length > 0) {
      submit_validate($('form[id^="edit_"]'));
      id = "#{ @products_lot.product_id.to_json }";
      $('#product-select option[value="'+id+'"]').prop('selected', 'selected')
    }else{
      submit_validate($('#new_products_lot'));
    }
  });