app/views/products_lots/_report_lote_by_product.haml

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
              %td
                = Product.find(unit.product_id).name