app/views/products_lots/_table.haml

              %td
                = Product.find(unit.product_id).name
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1