app/views/stock_for_articles/_report_table.haml

              %td{"style"=>"text-align:center"}
                = Article.find(unit.article_id).name
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1