app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
  def index
    @article = Article.all

SELECT `categories`.* FROM `categories`
---
  def new
    @article = Article.new
    @today = Time.now
    @categories = Category.all

INSERT INTO `articles` (`created_at`, `due_date`, `lot_number`, `name`, `production_date`, `quantity`, `sanitary_registry`, `trademark`, `unit_of_measurement`, `updated_at`) VALUES ('2016-10-13 11:45:17', '2033-02-08', 'adad', 'Atun', '2016-10-13', 200.0, '12012', 'Picaflor', 'Kg', '2016-10-13 11:45:17')
---
  def create
    flash[:error] = nil
    article = Article.new(article_parameters)
    article.stock = 0
    if article.save

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
UPDATE `articles` SET `quantity` = 300.0, `due_date` = '2016-12-30', `lot_number` = '63335', `production_date` = '2016-07-06', `updated_at` = '2016-10-13 12:02:05' WHERE `articles`.`id` = 1
---
  def update
    flash[:error] = nil
    article = Article.find(params[:id])
    if article.update_attributes(article_parameters)