app/controllers/businesses_controller.rb

SELECT `businesses`.* FROM `businesses`
---
  def index
    @business = Business.all

INSERT INTO `businesses` (`address`, `contact`, `created_at`, `name`, `phone`, `ruc`, `updated_at`) VALUES ('Av. La Encalada 999', 'Rodolfo Cuadros', '2016-10-18 16:59:14', 'Gloria S.A.', '1234567', '12103120391', '2016-10-18 16:59:14')
---
  def create
    flash[:error] = nil
    business = Business.new(business_params)
    if business.save

SELECT `businesses`.* FROM `businesses` WHERE `businesses`.`id` = 1 LIMIT 1
---
  def edit
    @business = Business.find(params[:id])

SELECT `businesses`.* FROM `businesses` WHERE `businesses`.`id` = 1 LIMIT 1
UPDATE `businesses` SET `name` = 'Gloria S.A.C.', `updated_at` = '2016-10-18 17:10:12' WHERE `businesses`.`id` = 1
---
  def update
    flash[:error] = nil
    business = Business.find(params[:id])
    if business.update_attributes(business_params)

DELETE FROM `businesses` WHERE `businesses`.`id` = 2
---
  def destroy
    business = Business.destroy(params[:id])