app/controllers/categories_controller.rb

  def index
    @category = Category.all
---
SELECT `categories`.* FROM `categories`

  def create
    flash[:error] = nil
    category = Category.new(category_params)
    if category.save
---
INSERT INTO `categories` (`created_at`, `name`, `updated_at`) VALUES ('2016-10-12 22:22:45', 'Lácteos', '2016-10-12 22:22:45')

  def edit
    @category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1

  def update
    flash[:error] = nil
    category = Category.find(params[:id])
    if category.update_attributes(category_params)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `name` = 'Lácteos A', `updated_at` = '2016-10-12 22:22:50' WHERE `categories`.`id` = 1

  def destroy
    category = Category.destroy(params[:id])
---
DELETE FROM `categories` WHERE `categories`.`id` = 2