app/controllers/clients_controller.rb

  def index
    @client = Client.all
---
SELECT `clients`.* FROM `clients`

  def create
    flash[:error] = nil
    client = Client.new(client_parameters)
    if client.save
---
INSERT INTO `clients` (`address`, `contact`, `created_at`, `name`, `phone`, `ruc`, `updated_at`) VALUES ('calle 1', 'Alfredo', '2016-09-14 23:48:43', 'Primax', '123456789', '12345678901', '2016-09-14 23:48:43')

  def edit
    @client = Client.find(params[:id])
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 2 LIMIT 1

  def update
    flash[:error] = nil
    client = Client.find(params[:id])
    if client.update_attributes(client_parameters)
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 2 LIMIT 1
UPDATE `clients` SET `name` = 'Primax SA', `updated_at` = '2016-10-12 21:16:22' WHERE `clients`.`id` = 1

  def destroy
    client = Client.destroy(params[:id])
---
DELETE FROM `clients` WHERE `clients`.`id` = 2