app/controllers/contracts_controller.rb

SELECT `contracts`.* FROM `contracts`
---
  def index
    @contracts = Contract.all

SELECT `contracts`.* FROM `contracts` WHERE `contracts`.`id` = 1 LIMIT 1
---
  def show
    @contract = Contract.find(params[:id])

SELECT `articles`.* FROM `articles`
SELECT `clients`.* FROM `clients`
---
  def new
    @contract = Contract.new
    @articles = Article.all
    @clients = Client.all

INSERT INTO `contracts` (`client_id`, `code`, `created_at`, `date_of_issue`, `end_date`, `final_price`, `missing_payment`, `name`, `start_date`, `updated_at`) VALUES (1, '', '2016-09-14 23:53:31', '2016-09-14', '2016-10-14', 200.0, 200.0, 'COntrato 11', '2016-09-14', '2016-09-14 23:53:31')
SELECT `contract_details`.* FROM `contract_details` WHERE `contract_details`.`contract_id` = 1
---
  def create
    flash[:error] = nil
    contract = Contract.new(contract_parameters)
    contract.date_of_issue = Time.now.to_date
    contract.missing_payment = contract.final_price
    if contract.save
      contract.contract_details.each do |cd|

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
  def add_item
    @reg_n = ((Time.now.to_f)*100).to_i
    @article = Article.find(params[:article_id])