app/controllers/drivers_controller.rb

  def index
    @driver = Driver.all
---
SELECT `drivers`.* FROM `drivers`

  def create
    flash[:error] = nil
    driver = Driver.new(driver_params)
    if driver.save
---
INSERT INTO `drivers` (`created_at`, `license`, `name`, `updated_at`) VALUES ('2016-10-12 20:46:34', 'ABCDEF33', 'Alfredo', '2016-10-12 20:46:34')

  def edit
    @driver = Driver.find(params[:id])
---
SELECT `drivers`.* FROM `drivers` WHERE `drivers`.`id` = 1 LIMIT 1

  def update
    flash[:error] = nil
    driver = Driver.find(params[:id])
    if driver.update_attributes(driver_params)
---
SELECT `drivers`.* FROM `drivers` WHERE `drivers`.`id` = 1 LIMIT 1
UPDATE `drivers` SET `name` = 'Betoasaber', `updated_at` = '2016-10-12 21:20:26' WHERE `drivers`.`id` = 2

  def destroy
    driver = Driver.destroy(params[:id])
---
DELETE FROM `drivers` WHERE `drivers`.`id` = 3