app/controllers/products_lots_controller.rb

  def index
    @products_lot =  ProductsLot.select("product_id, sum(quantity) as quantity").group("product_id")
---
SELECT product_id, sum(quantity) as quantity FROM `products_lots` GROUP BY product_id

  def new
    @products_lot = ProductsLot.new
    @products = Product.all
---
SELECT `products`.* FROM `products`

  def create
    flash[:error] = nil
    products_lot = ProductsLot.new(products_lot_params)
    if products_lot.save
---
INSERT INTO `products_lots` (`created_at`, `due_date`, `lot_number`, `product_id`, `production_date`, `quantity`, `sanitary_registry`, `updated_at`) VALUES ('2016-10-19 12:46:36', '2016-10-29', 'adasdas2', 1, '2016-10-06', 200.0, 'dasdas26d2as', '2016-10-19 12:46:36')

  def edit
    @products_lot = ProductsLot.find(params[:id])
    @products = Product.all
---
SELECT `products_lots`.* FROM `products_lots` WHERE `products_lots`.`id` = 1 LIMIT 1
SELECT `products`.* FROM `products`

  def update
    flash[:error] = nil
    products_lot = ProductsLot.find(params[:id])
    if products_lot.update_attributes(products_lot_params)
---
SELECT `products_lots`.* FROM `products_lots` WHERE `products_lots`.`id` = 1 LIMIT 1
UPDATE `products_lots` SET `quantity` = 400.0, `updated_at` = '2016-10-19 21:03:45' WHERE `products_lots`.`id` = 1

  def destroy
    products_lot = ProductsLot.destroy(params[:id])
---
DELETE FROM `products_lots` WHERE `products_lots`.`id` = 3

  def due_method
    limit_date = params[:end_date]
    @products_lots = ProductsLot.where("due_date <= ?",limit_date)
---
SELECT `products_lots`.* FROM `products_lots` WHERE (due_date <= '2016-10-31')

  def lote_front
    @products = Product.all
---
SELECT `products`.* FROM `products`

  def lote_by_product
    product_id = params[:product_id]
    @products_lots = ProductsLot.where("product_id = ? and quantity > 0",product_id)
---
SELECT `products_lots`.* FROM `products_lots` WHERE (product_id = '1' and quantity > 0)

  def lote_method
    product_id = params[:product_id]
    @products_lots = ProductsLot.where("product_id = ?",product_id)
---
SELECT `products_lots`.* FROM `products_lots` WHERE (product_id = '1')

  def empty_lots
    product_id = params[:product_id]
    @products_lots = ProductsLot.where("product_id = ? and quantity = 0",product_id)
---
SELECT `products_lots`.* FROM `products_lots` WHERE (product_id = '1' and quantity = 0)