app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
---
  def index
    @product = Product.all

SELECT `categories`.* FROM `categories`
---
  def new
    @product = Product.new
    @today = Time.now
    @categories = Category.all

INSERT INTO `products` (`category_id`, `created_at`, `name`, `trademark`, `unit_of_measurement`, `updated_at`) VALUES (1, '2016-10-18 23:26:28', 'Leche Gloria en Latas', 'Gloria', 'Latas', '2016-10-18 23:26:28')
---
  def create
    flash[:error] = nil
    product = Product.new(product_parameters)
    if product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories`
---
  def edit
    @product = Product.find(params[:id])
    @categories = Category.all

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
UPDATE `products` SET `description` = 'Leche en latas de 500ml', `updated_at` = '2016-10-18 23:28:13' WHERE `products`.`id` = 1
---
  def update
    flash[:error] = nil
    product = Product.find(params[:id])
    if product.update_attributes(product_parameters)