app/controllers/purchase_orders_controller.rb

  def index
    @purchase_orders = PurchaseOrder.all
---
SELECT `purchase_orders`.* FROM `purchase_orders`

  def show
    @purchase_order = PurchaseOrder.find(params[:id])
---
SELECT `purchase_orders`.* FROM `purchase_orders` WHERE `purchase_orders`.`id` = 1 LIMIT 1

  def new
    @purchase_order = PurchaseOrder.new
    @articles = Article.all
    @suppliers = Supplier.all
---
SELECT `articles`.* FROM `articles`
SELECT `suppliers`.* FROM `suppliers`

  def create
    flash[:error] = nil
    purchase_order = PurchaseOrder.new(purchase_order_parameters)
    if purchase_order.save
      purchase_order.purchase_order_details.each do |pod|
        article = Article.find(pod.article_id)
        article.stock = article.stock + pod.quantity
        article.save
---
INSERT INTO `purchase_orders` (`billing_address`, `code`, `created_at`, `date_of_issue`, `delivery_address`, `delivery_date`, `order_date`, `supplier_id`, `updated_at`) VALUES ('dadss', 'adadas', '2016-10-14 02:50:29', '2016-10-13', 'adasdasd', '2017-01-26', '2016-10-14', 1, '2016-10-14 02:50:29')
SELECT `purchase_order_details`.* FROM `purchase_order_details` WHERE `purchase_order_details`.`purchase_order_id` = 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `stock` = 200.0, `updated_at` = '2016-09-15 00:03:12' WHERE `articles`.`id` = 1

  def add_item
    @reg_n = ((Time.now.to_f)*100).to_i
    @article = Article.find(params[:article_id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1