app/controllers/remission_guides_controller.rb

  def index
    @remission_guides = RemissionGuide.all
---
SELECT `remission_guides`.* FROM `remission_guides`

  def show
    @remission_guide = RemissionGuide.find(params[:id])
---
SELECT `remission_guides`.* FROM `remission_guides` WHERE `remission_guides`.`id` = 1 LIMIT 1

  def new
    @remission_guide = RemissionGuide.new
    @articles = Article.all
    @clients = Client.all
    @transports = Transport.all
---
SELECT `articles`.* FROM `articles`
SELECT `clients`.* FROM `clients`
SELECT `transports`.* FROM `transports`

  def create
    flash[:error] = nil
    remission_guide = RemissionGuide.new(remission_guide_parameters)
    if remission_guide.save
      remission_guide.remission_guide_details.each do |rgd|
        article = Article.find(rgd.article_id)
        article.stock = article.stock - rgd.quantity
        article.save
---
INSERT INTO `remission_guides` (`client_id`, `code`, `created_at`, `date_of_issue`, `final_point`, `initial_point`, `transport_id`, `updated_at`) VALUES (1, '8858', '2016-09-15 00:16:36', '2016-09-14', 'HDFHFHG', 'THT', 1, '2016-09-15 00:16:36')
SELECT `remission_guide_details`.* FROM `remission_guide_details` WHERE `remission_guide_details`.`remission_guide_id` = 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `stock` = 0.0, `updated_at` = '2016-09-15 00:16:36' WHERE `articles`.`id` = 1

  def add_item
    @reg_n = ((Time.now.to_f)*100).to_i
    @article = Article.find(params[:article_id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1