app/controllers/stock_for_articles_controller.rb

SELECT `articles`.* FROM `articles`
---
  def index
    @article = Article.all

SELECT `purchase_order_details`.* FROM `purchase_order_details` WHERE (due_date >= '2016-11-30')
---
  def due_method
    limit_date = params[:end_date]
    @articles = PurchaseOrderDetail.where("due_date >= ?",limit_date)

SELECT `articles`.* FROM `articles`
---
  def lote_front
    @articles = Article.all

SELECT `purchase_order_details`.* FROM `purchase_order_details` WHERE (article_id = '3')
---
  def lote_method
    article_id = params[:article_id]
    @articles = PurchaseOrderDetail.where("article_id = ?",article_id)