app/controllers/stock_for_articles_controller.rb

SELECT `products`.* FROM `products`
---
  def index
    @product = Product.all