app/controllers/suppliers_controller.rb

SELECT `suppliers`.* FROM `suppliers`
---
  def index
    @supplier = Supplier.all

INSERT INTO `suppliers` (`address`, `contact`, `created_at`, `name`, `phone`, `ruc`, `updated_at`) VALUES ('cALLA 2', 'aLFREDO', '2016-09-14 23:56:47', 'Gloria', '1234567', '78965432101', '2016-09-14 23:56:47')
---
  def create
    flash[:error] = nil
    supplier = Supplier.new(supplier_parameters)
    if supplier.save

SELECT `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 1 LIMIT 1
---
  def edit
    @supplier = Supplier.find(params[:id])