app/controllers/transports_controller.rb

SELECT `transports`.* FROM `transports`
---
  def index
    @transport = Transport.all

INSERT INTO `transports` (`created_at`, `inscriptions`, `plate`, `updated_at`) VALUES ('2016-09-15 00:09:03', 'SFSDFSDF', 'Q4S789', '2016-09-15 00:09:03')
---
  def create
    flash[:error] = nil
    transport = Transport.new(transport_parameters)
    if transport.save

SELECT `transports`.* FROM `transports` WHERE `transports`.`id` = 1 LIMIT 1
---
  def edit
    @transport = Transport.find(params[:id])

SELECT `transports`.* FROM `transports` WHERE `transports`.`id` = 1 LIMIT 1
UPDATE `transports` SET `trademark` = 'Toyota Hilux', `updated_at` = '2016-10-12 18:46:10' WHERE `transports`.`id` = 1
---
  def update
    flash[:error] = nil
    transport = Transport.find(params[:id])
    if transport.update_attributes(transport_parameters)