app/controllers/vouchers_controller.rb

  def index
    @vouchers = Voucher.all
---
SELECT `vouchers`.* FROM `vouchers`

  def show
    @voucher = Voucher.find(params[:id])
---
SELECT `vouchers`.* FROM `vouchers` WHERE `vouchers`.`id` = 1 LIMIT 1

  def new
    @voucher = Voucher.new
    @articles = Article.all
    @clients = Client.all
---
SELECT `articles`.* FROM `articles`
SELECT `clients`.* FROM `clients`

  def create
    flash[:error] = nil
    voucher = Voucher.new(voucher_parameters)
    if voucher.save
---
INSERT INTO `vouchers` (`client_id`, `code`, `created_at`, `date_of_issue`, `updated_at`) VALUES (1, '', '2016-09-15 00:22:18', '2016-09-14', '2016-09-15 00:22:18')

  def add_item
    @reg_n = ((Time.now.to_f)*100).to_i
    @article = Article.find(params[:article_id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1