app/views/products/_form.haml


  $(document).ready(function () {
    if($('form[id^="edit_"]').length > 0) {
      submit_validate($('form[id^="edit_"]'));
      id = "#{ @product.category_id.to_json }";
      $('#category-select option[value="'+id+'"]').prop('selected', 'selected')
    }else{
      submit_validate($('#new_product'));
    }
  });
---
SELECT `categories`.* FROM `categories`