app/views/products/_table.haml

SELECT `categories`.* FROM `categories` WHERE `categories`.`product_id` = 1 ORDER BY `categories`.`id` ASC LIMIT 1
---
              %td
                = Category.find(unit.category_id).name